# Функция для подсчета количества букв в тексте
def count_letters(text):
    letters_count = {}
    for char in text.lower():  # Преобразуем текст к нижнему регистру
        if char.isalpha():  # Проверяем, является ли символ буквой
            letters_count[char] = letters_count.get(char, 0) + 1
    return letters_count

# Функция для вычисления частоты букв
def calculate_frequency(letters_count):
    total_letters = sum(letters_count.values())
    frequency_dict = {letter: round(count / total_letters, 2) for letter, count in letters_count.items()}
    return frequency_dict
main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""
letters_count = count_letters(main_str)

frequencies = calculate_frequency(letters_count)

for letter, frequency in frequencies.items():
    print(f"{letter}: {frequency:.2f}")
# TODO Распечатайте в столбик букву и её частоту в тексте
